package messages

// generic controls
const (
	Approve = "✅ OK"
	Reject  = "❌ Закрыть"
	Back    = "🔙 Назад"
)

// main menu
const (
	Cb5   = "😈 Добавить дроп с 5 КБ"
	Cb6   = "👹 Добавить дроп с 6 КБ"
	Cb4   = "👾 Добавить дроп с 4 КБ"
	Stats = "📈 Cтатистика"
	Help  = "ℹ️ Помощь и обратная связь"
)

// add drop inline menu
const (
	Clear        = "🔄 Заново"
	AncientShard = "💙 Древний"
	VoidShard    = "💜 Темный"
	SacredShard  = "💛 Сакрал"
	EpicTome     = "📘 Эпик том"
	LegTome      = "📙 Лег том"
)

// stats menu
const (
	LastVoidShard   = "💜 Последний войд"
	LastSacredShard = "💛 Последний сакрал"
	LastLegTome     = "📙 Последний лег том"
	MonthStats      = "📅 Весь мой дроп"
)

//month menu
const (
	Jan = "Январь"
	Feb = "Февраль"
	Mar = "Март"
	Apr = "Апрель"
	May = "Май"
	Jun = "Июнь"
	Jul = "Июль"
	Aug = "Август"
	Sep = "Сентябрь"
	Oct = "Октябрь"
	Nov = "Ноябрь"
	Dec = "Декабрь"
)

const (
	Days30 = "30 дней"
	Days7  = "7 дней 📼📞📺👻☠️"
)
